Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon class represents the tolerated Tekla.Structures.Model.Polygon face.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon.#ctor(Tekla.Structures.Model.Polygon,Tekla.Common.Geometry.Vector3)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon class.
target: The target.
hitPoint: The hit point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon.#ctor(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.HitPolygon class.
toleratedFace: The tolerated face.